art_share_api/app/controllers/artworks_controller.rb

  def index
    @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"

  def show
    @artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]

  def update
    @artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]