art_share_api/app/controllers/artworkshares_controller.rb

  def index
    @artworkshares = ArtworkShare.all
---
SELECT "artwork_shares".* FROM "artwork_shares"

  def show
    @artworkshare = ArtworkShare.find(params[:id])
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def destroy
    @artworkshare = ArtworkShare.find(params[:id])
    @artworkshare.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 4]]