art_share_api/app/controllers/artwork_shares_controller.rb

  def create
    #debugger
    artworkshare = ArtworkShare.new(artwork_share_params)
    if artworkshare.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 14], ["viewer_id", 23], ["created_at", "2022-03-10 16:09:25.344239"], ["updated_at", "2022-03-10 16:09:25.344239"]]