art_share_api/app/controllers/comments_controller.rb

  def index
    #debugger
    #params["comment"]["user_id"]
    if params[:user_id]
      render json: Comment.where(user_id: params[:user_id])
    elsif params[:artwork_id]
      render json: Comment.where(artwork_id: params[:artwork_id])
    elsif params[:id]
      render json: Comment.where(id: params[:id])
    else
      render json: Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 28]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 19]]
SELECT "comments".* FROM "comments"