art_share_api/app/controllers/users_controller.rb

  def index
    # debugger
    if params[:username]
      @users = User.where('username LIKE ?', "%#{params[:username]}%")
    else
      @users = User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "robert"]]

  def create
    #debugger
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Donny"], ["email", "Donnydarko@gmail.com"], ["created_at", "2022-03-09 19:36:39.446741"], ["updated_at", "2022-03-09 19:36:39.446741"]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "\"Johnny5000\""], ["updated_at", "2022-03-10 15:11:23.040769"], ["id", 18]]