art_share_api/app/controllers/concerns/likes_controller.rb

  def index
    #debugger
    #params["comment"]["user_id"]
    if params[:user_id]
      render json: Like.where(user_id: params[:user_id])
    else
      render json: Like.all
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 34]]
SELECT "likes".* FROM "likes"