first_routes_controllers/app/controllers/users_controller.rb

  def create
    #debugger
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Donny"], ["email", "Donnydarko@gmail.com"], ["created_at", "2022-03-09 19:36:39.446741"], ["updated_at", "2022-03-09 19:36:39.446741"]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "John"], ["updated_at", "2022-03-09 19:54:11.100449"], ["id", 1]]